---
kind: other
id: Properties.T:Autodesk.Revit.DB.StartingViewSettings
source: html/85c21b13-ea51-bd74-4525-9ebee9b99794.htm
---
# StartingViewSettings Properties

The id of the assembly instance to which the element belongs.